import React from 'react'

function About() {
	const [open, setOpen] = React.useState(false)

	return (
		<section id='about'>
			<div className='container'>
				<div className='about'>
					<div className='about_text'>
						<div className='about_text_main'>Народження легенди</div>
						<div className='about_text_sec'>
							У 1907 р. відбулася історична подія: відчинив свої двері
							"Amethyst", що зайняв одну із знаменитих будівель району Ноб-Хілл.
							Цей відомий готель став одним із головних місць проведення
							розкішних балів, президентських візитів та політичних зустрічей,
							завдяки чому "Amethyst" стали називати «місцем, де трапляються
							події». Це стало благодатним підґрунтям для народження бренду
							"Amethyst".
						</div>
					</div>
					<button
						href=''
						className='about_button'
						onClick={() => setOpen(true)}
					>
						Більше про готель
					</button>
					<div
						className={`about_button_more ${open ? '' : 'show'}`}
						onClick={() => setOpen(false)}
					>
						<div className='more_content' onClick={e => e.stopPropagation()}>
							<span>Історія готелю</span>
							<button className='more_close' onClick={() => setOpen(false)}>
								X
							</button>
							<div className='more_text'>
								<hr />
								<p>
									{' '}
									У 1907 р. відбулася історична подія: відчинив свої двері
									"Amethyst", що зайняв одну із знаменитих будівель району
									Ноб-Хілл. Цей відомий готель став одним із головних місць
									проведення розкішних балів, президентських візитів та
									політичних зустрічей, завдяки чому "Amethyst" стали називати
									«місцем, де трапляються події». Це стало благодатним
									підґрунтям для народження бренду "Amethyst".{' '}
								</p>
								<h2>Розкішні номери у самому центрі міста.</h2>
								<hr />
								<p>
									Готель "Amethyst" - це більше, ніж просто номери класу люкс,
									бари та ресторани світового класу та чудове розташування. Тут
									у гостей з'являються незабутні спогади. Можливо, саме тому так
									багато знаменитостей, представників королівських сімей,
									політиків та художників віддавали перевагу і продовжують
									віддавати перевагу готелям "Amethyst".
								</p>
								<hr />
								<p>
									Клод Моне малював знамениті лондонські пейзажі, зупиняючись у
									"Amethyst". Більше того, вчені визначили з яких саме балконів
									відкривається той вид, який малював художник, ґрунтуючись на
									висвітленні на його картинах (номери 610 та 611 у 1900 та
									номери 510 та 511 у 1901). Ноел Кауард одужував від грипу і
									завершував свою комедію «Приватні життя», перебуваючи у
									пентхаусі готелю "НАЗВАНИЕ" у Києві. Список найбільших
									голлівудських зірок та інших відомих особистостей на цьому не
									закінчується.
								</p>
								<hr />
								<p>
									Наші готелі грали найважливіші ролі у історичних подіях.
									Статут ООН було складено та підписано представниками 50 країн
									у залі «Garden» у готелі "Amethyst". У 1943 році Вільям Лайон
									Маккензі Кінг приймав Уїнстона Черчілля і Франкліна Д.
									Рузвельта в "Amethyst", де політичні діячі складали плани
									Нормандського вторгнення до Європи. Леннон та Йоко Оно
									влаштували історичну акцію «У ліжку за мир» у "Amethyst" у
									1969 році. Саме під час цієї акції колишній соліст Beatles
									написав текст і записав пісню Give Peace a Chance, що стала
									гімном антивоєнного руху.
								</p>
								<hr />
								<p>
									Наші легендарні готелі користуються популярністю серед
									королівських осіб. Так, королева Єлизавета II зупинялася в
									кожну декаду свого правління. Крім того, ми приймали у себе
									місцевих знаменитостей під час їх перших балів, проводили
									численні чаювання з танцями та розкішні святкові трапези. Наша
									мета — подарувати незабутні враження кожному гостю, який
									прийшов на ваш захід, чи то легендарна подія, про яку будуть
									писати в газетах, чи місце для штаб-квартири британської
									розвідки на Бермудах, яка працює над зломом шифрів.
								</p>
							</div>
						</div>
					</div>
				</div>
			</div>
		</section>
	)
}

export default About
