import React from 'react'

function Rules() {
	const [open, setOpen] = React.useState(false)

	return (
		<>
			<section id='rules'>
				<div className='container'>
					<div className='rules'>
						<div className='rules_text'>
							"Amethyst" є ідеальним місцем для елегантних мандрівників та
							місцем проведення найзнакових подій у Києві. Готель розташований у
							самому центрі історичного центру міста, за дві хвилини від чудової
							набережної, архітектурних пам'яток та різноманітних ресторанів.
							Кожен з 258 номерів готелю Kyiv оформлено стильно та елегантно.
						</div>
						<button className='rules_btn' onClick={() => setOpen(true)}>
							Правила
						</button>
						<div
							className={open ? 'rules_modal active' : 'rules_modal'}
							onClick={() => setOpen(false)}
						>
							<div
								className='rules_modal_content'
								onClick={e => e.stopPropagation()}
							>
								<span>Правила</span>
								<button className='rules_close' onClick={() => setOpen(false)}>
									X
								</button>
								<div className='rules_modal_text'>
									<span>
										<p>
											Діти до 5 років без надання додаткового місця і харчування
											проживають безкоштовно.
										</p>
										<p>
											Туристичний збір сплачується додатково у розмірі 60 грн -
											для нерезидентів (іноземці) та 24 грн - для резидентів
											(українці) за одну добу проживання відповідно до
											Податкового кодексу України.
										</p>
										<p>
											Номери готелю однієї категорії не є абсолютно ідентичними
											і можуть трохи відрізнятися інтер’єром, внутрішнім
											оздобленням і обладнанням.
										</p>
										<p>
											Умови розміщення : Реєстрація та заселення в готель
											починається о 14:00 за місцевим часом. Виселення з готелю
											до 12:00 за місцевим часом. За умови заселення з 00:00 до
											06:00 необхідно сплатити 100% від вартості номера за одну
											розрахункову добу. Виселення на загальних умовах. Ранній
											заїзд після 06:00 здійснюється без доплати і можливий
											тільки за наявності вільних номерів. За проживання в
											готелі менше розрахункової доби необхідно сплати повну
											вартість кімнати за розрахункову добу. Виїзд з готелю
											після 12:00 можливий за умови наявності вільних номерів.
											Ця послуга є платною, а саме — 25% від вартості номеру до
											15:00, 50% від вартості номеру до 24:00.
										</p>
										<p>
											Умови розрахування : Сплатити проживання необхідно при
											поселенні. Готель приймає до сплати готівку (гривня),
											кредитні картки Visa, Maestro, MasterCard, American
											Express, можлива безготівкова форма оплати (за попередньою
											домовленістю).
										</p>
										<p>
											У разі неприбуття гостя до 18:00 (час анулювання броні)
											дня заїзду, заявка анулюється, якщо бронювання номера не
											було підтверджене додатково.
										</p>
										<p>
											Заборона паління: Згідно із Законом України № 4844-VI від
											24.05.2012 року забороняється куріння тютюнових виробів,
											електронних сигарет і кальянів на території всього готелю
											(номерах, коридорах, фойє, кафе та ресторані).
											Дозволяється курити в спеціально відведеному місці.
											Кімната для паління знаходиться на 1 поверсі готелю.
										</p>
									</span>
								</div>
								{/* <div class='rules_modal_text_768'>
									<span>
										Діти до 5 років без надання додаткового місця і харчування
										проживають безкоштовно Туристичний збір сплачується
										додатково у розмірі 60 грн. для нерезидентів (іноземці) та
										24 грн. для резидентів (українці) за одну добу проживання
										відповідно до Податкового кодексу України. Номери готелю
										однієї категорії не є абсолютно ідентичними і можуть трохи
										відрізнятися інтер’єром, внутрішнім оздобленням і
										обладнанням. Умови розміщення : Реєстрація та заселення в
										готель починається о 14:00 за місцевим часом. Виселення з
										готелю до 12:00 за місцевим часом. За умови заселення з
										00:00 до 06:00 необхідно сплатити 100% від вартості номера
										за одну розрахункову добу. Виселення на загальних умовах.
										Ранній заїзд після 06:00 здійснюється без доплати і можливий
										тільки за наявності вільних номерів. За проживання в готелі
										менше розрахункової доби необхідно сплати повну вартість
										кімнати за розрахункову добу. Виїзд з готелю після 12:00
										можливий за умови наявності вільних номерів. Ця послуга є
										платною, а саме — 25% від вартості номеру до 15:00, 50% від
										вартості номеру до 24:00 Умови розрахування : Сплатити
										проживання необхідно при поселенні. Готель приймає до сплати
										готівку (гривня), кредитні картки Visa, Maestro, MasterCard,
										American Express, можлива безготівкова форма оплати (за
										попередньою домовленістю). Туристичний збір (60 грн. для
										нерезидентів (іноземці) та 24 грн. для резидентів (українці)
										за одну добу проживання) оплачується окремо при поселенні. У
										разі неприбуття гостя до 18:00 (час анулювання броні) дня
										заїзду, заявка анулюється, якщо бронювання номера не було
										підтверджене додатково. Заборона паління: Згідно із Законом
										України № 4844-VI від 24.05.2012 року забороняється куріння
										тютюнових виробів, електронних сигарет і кальянів на
										території всього готелю (номерах, коридорах, фойє, кафе та
										ресторані). Дозволяється курити в спеціально відведеному
										місці. Кімната для паління знаходиться на 1 поверсі готелю
									</span>
								</div> */}
							</div>
						</div>
					</div>
				</div>
			</section>
		</>
	)
}

export default Rules
